{
  "slug": "farmers-herders-violence-ekiti",
  "metadata": {
    "journal": "Journal of Peace Service Academy (JoPSA)",
    "volume": "Vol. 1",
    "number": "No. 1",
    "year": "2026",
    "pages": "1-11",
    "issn": "2224-3453",
    "doi": "10.5555/jopsa.2026.1.1.001"
  },
  "title": "Farmers-Herders Violence: An Evaluation of its Impact on Communal Livelihoods in Ekiti, Nigeria",
  "authors": [
    { "name": "Oseremen F. IRENE", "title": "Ph.D" },
    { "name": "Benson E. ADAMS", "title": "" }
  ],
  "abstract": "Numerous factors, including the violent threat posed by farmers-herders violence, pose threats to the livelihoods to many Africans. The implication of the violence on communal livelihoods in sub-Saharan Africa, with a location in Nigeria as a case study, is the subject of this study. The study employs qualitative research method, and in-depth interviews serves as the source of primary data. Purposive sampling technique was used to select 18 key informants that serve as sample size for the study. Thematic content analysis was used to analyze the collected data. According to the study's findings, loss of livelihoods, properties, farm produce, people's displacement, and insecurity, loss of internally generated revenue, sexual harassment, diminished social life, and death are some of the impact of the mayhem. Additionally, ordeal has implication on trust, as trust deficit swells between the herders and farmers communities. The study reveals that if local peace infrastructures, early warning and response mechanisms, and formal and informal strong security networking are encouraged and implemented in local communities, it would help to safeguard farmers' crops and herdsmen's cattle theft, as well as reduce violence menace to the barest minimum.",
  "keywords": ["Farmers-Herders", "Violence", "Impact", "Livelihoods", "Ekiti", "Nigeria"],
  "sections": [
    {
      "id": "intro",
      "title": "Herdsmen-Farmers’ Violence",
      "content": "In Nigeria, the recurrent wave of herdsmen-farmers violence is becoming increasingly alarming and frightening. It is a serious threat to the nation's unity and safety. A number of organizations have requested that the ruthless herdsmen be classified as terrorists (Akinfenwa, 2021). According to Ogo-Oluwa (2017), herdsmen-farmers attacks are on the rise in numerous Nigerian communities. According to Idowu (2017), there have been an increase in the number of incidents where natives of the invaded farming communities, including women and children, have been brutally killed by herdsmen.\n\nHe says that the states that have been affected the most are: Benue, Nassarawa, Plateau, Taraba, Kaduna, Adamawa, Zamfara, Oyo, Imo, Cross River, Abia, Ebonyi, Ekiti, and Rivers. According to Shehu (2018), herdsmen typically target their target communities at times when they are most vulnerable, such as at midday or on days of prayer, when they are in their churches or mosques. They use sophisticated weapons to kill and maim people, loot properties, and set fire to homes. The violent attacks of herdsmen on their host communities claimed over 1,229 lives and property worth hundreds of millions of Naira in 2014 alone, and over 800 deaths were recorded in 2015 (Global Terrorism Index, 2015)."
    },
    {
      "id": "method",
      "title": "Method",
      "content": "Interviews are used to gather primary data for this qualitative study in Nigeria. All residents of the study area in Nigeria—herders, farmers, security personnel, traditional institutions, men, women, and children—are included in this study's population. The study used a sample size of 18 key informants chosen from farmers, herders, community leaders (political class), traditional rulers, youth groups, and security personnel in Local Government Area. In order to accomplish this, participants in the interview were selected using the purposive sampling method. The Key Informant Interview (KII) served as the primary research instrument and data source for the study. Thematic content analysis was used to analyze the primary data collected for the study."
    },
    {
      "id": "theme1",
      "title": "Theme 1: Nature of Herdsmen Violence",
      "content": "The vast majority of those surveyed viewed conflict as a process that occurs in every society. They argued that conflicts among people are an attempt to gain access to the limited resources available in society. In Ikole-Ekiti, the violent threat posed by farmers and herders to communal livelihoods comes in many forms and hues. The traditional ruler of Isaba-Ekiti, one of the affected communities in Ikole-Ekiti, claimed that a dispute between a farmer and some herdsmen was the beginning of the violence in March 2021."
    },
    {
      "id": "theme2",
      "title": "Theme 2: Causes of Herdsmen Violence",
      "content": "Many informants argued that the destruction of farm produce by the cattle of the herdsmen is the major cause. According to the informants, one of the primary causes of tension between the herdsmen, farmers, and the community as a whole, which results in violent attacks, was the herdsmen's cattle's destruction of farm produce. Herders typically send their cattle to graze during the day or at night, which typically results in the destruction of farms and farm produce."
    },
    {
      "id": "theme3",
      "title": "Theme 3: Socio-economic Implications",
      "content": "It is a known fact that violent attacks and communal clashes usually have varying and attendant social and economic implications and the incessant herdsman violent menace on communities in Ikole – Ekiti is not an exception. Almost everyone in the affected communities experienced one form of socio-economic loss or the other. Government properties are destroyed while the properties and houses of community members were looted."
    },
    {
      "id": "theme4",
      "title": "Theme 4: Strategies for Curbing Violence",
      "content": "One of the police officers who participated in the interview believes that the security agencies ought to take a more proactive approach and begin conducting regular patrols of the locations that are known to be the target of attacks of this kind. Additionally, he suggested providing employment as one strategy for combating this threat."
    },
    {
      "id": "conclusion",
      "title": "Conclusion",
      "content": "The communal livelihoods of many Africans are seriously threatened by the current waves of farmers-herdsmen violent menace and other security issues in Nigeria and Africa. In Nigeria and throughout Africa, the violent conflict between farmers and herdsmen has widened social divides and caused immense economic hardship for both groups. The problem's multidimensional nature necessitates a multidimensional approach to solving it."
    }
  ],
  "references": [
    "Aanuoluwapo, B. (2018). Fulani Herdsmen attack farmers in Oyo State. Retrieved in www.nigerianmonitor.com.",
    "Adegun, A. (2016). Herdsmen killed 808 people, destroyed 1,422 houses in Southern Kaduna - Catholic Church.",
    "Akinfenwa, G. (2021). Declare killer herdsmen terrorists now. Activist urges Buhari. The Nation Online.",
    "Alagbe, B. (2018). Herdsmen crisis: Pain, anger of orphans in IDP camps. Punch NG.",
    "Chukwuma, O. A. (2016). The Trajectories and Dynamics of Herdsmen Militancy in Central Nigeria. Journal of Humanities and Social Policy, 2(1): 22 – 30.",
    "Idowu, A.O. (2017). Urban violence dimension in Nigeria: farmers and herders onslaught. AGATHOS, Volume 8, Issue 1 (14): 187-206"
  ]
}
